Revit 2027 API
FlexPipe.FlexPipeType Property
 The flex pipe type of this flex pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlexPipeType FlexPipeType { get; set; }
Public Property FlexPipeType As FlexPipeType
	Get
	Set
public:
property FlexPipeType^ FlexPipeType {
	FlexPipeType^ get ();
	void set (FlexPipeType^ value);
}
member FlexPipeType : FlexPipeType with get, set
Property Value
FlexPipeType
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace